Revit 2024 API
MEPSection Methods
The MEPSection type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCoefficient
 Gets the loss coefficient for the specified element id in this section.
GetElementIds
 Gets all element ids that are contained in the section.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPressureDrop
 Gets the pressure drop for the specified element id in this section.
GetSegmentLength
 Get the length for the specified segment id in this section.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsMain
 Check whether the type of fitting in this section is main.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace